## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azuread_application.rcm_adb_app will be destroyed
  # (because azuread_application.rcm_adb_app is not in configuration)
  - resource "azuread_application" "rcm_adb_app" {
      - app_role_ids                   = {} -> null
      - client_id                      = "80cc7a10-a6d8-4063-88d1-37c0f02b5645" -> null
      - device_only_auth_enabled       = false -> null
      - display_name                   = "vj-rcm-dev-adb-app" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "/applications/8b7a367f-d8a5-43ee-9d4b-e4ff87d47c70" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "8b7a367f-d8a5-43ee-9d4b-e4ff87d47c70" -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "vijaykrishnavk94gmail.onmicrosoft.com" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null
        # (11 unchanged attributes hidden)

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null
            # (2 unchanged attributes hidden)

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # azuread_application_registration.rcm_adf_app will be created
  + resource "azuread_application_registration" "rcm_adf_app" {
      + client_id                      = (known after apply)
      + disabled_by_microsoft          = (known after apply)
      + display_name                   = "vj-rcm-dev-adf-app"
      + id                             = (known after apply)
      + object_id                      = (known after apply)
      + publisher_domain               = (known after apply)
      + requested_access_token_version = 2
      + sign_in_audience               = "AzureADMyOrg"
    }

  # azuread_application_registration.rcm_adls_app will be created
  + resource "azuread_application_registration" "rcm_adls_app" {
      + client_id                      = (known after apply)
      + disabled_by_microsoft          = (known after apply)
      + display_name                   = "vj-rcm-dev-adls-app"
      + id                             = (known after apply)
      + object_id                      = (known after apply)
      + publisher_domain               = (known after apply)
      + requested_access_token_version = 2
      + sign_in_audience               = "AzureADMyOrg"
    }

  # azuread_service_principal.azure_adf_sp will be created
  + resource "azuread_service_principal" "azure_adf_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
      + use_existing                = true

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azuread_service_principal.azure_adls_sp will be created
  + resource "azuread_service_principal" "azure_adls_sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
      + use_existing                = true

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_key_vault_access_policy.rcm-adf-mi will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adf-mi" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Verify",
          + "Sign",
          + "Purge",
        ]
      + key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + object_id          = "6f0da0b0-27bb-4601-a4ed-81d234b09d39"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_access_policy.rcm-adf-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adf-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Verify",
          + "Sign",
          + "Purge",
        ]
      + key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_access_policy.rcm-adls-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adls-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

Plan: 7 to add, 0 to change, 1 to destroy.
```
</details>